<a href="https://colab.research.google.com/github/parul21/data_analytics/blob/master/ex4_data_transformation_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

cols = ['col0', 'col1', 'col2', 'col3', 'col4']
rows = ['row0', 'row1', 'row2', 'row3', 'row4']
data = np.random.randint(0, 100, size=(5, 5))
df = pd.DataFrame(data, columns=cols, index=rows)

df.head()

      col0  col1  col2  col3  col4
row0    69    88    41    84    90
row1    29     1    26    24    88
row2    52    77    79    48    32
row3    56    22    59    27    64
row4    50    86    10    93    55

In [3]:
df['col1']['row1']
df.loc['row4', 'col2']

10

In [6]:
df_new = df[['col1','col2']]
df_new.head(3)

      col1  col2
row0    88    41
row1     1    26
row2    77    79

In [7]:
#print ("flitering data frame") 
df[df['col1'] > 20]
# assigning variable also works
condition = df['col1'] > 20
df[condition]

      col0  col1  col2  col3  col4
row0    69    88    41    84    90
row2    52    77    79    48    32
row3    56    22    59    27    64
row4    50    86    10    93    55

In [8]:
df.iloc[3, 3] = 0
df.iloc[1, 2] = np.nan
df.iloc[4, 0] = np.nan
df['col5'] = 0
df['col6'] = np.NaN
df.head()

      col0  col1  col2  col3  col4  col5  col6
row0  69.0    88  41.0    84    90     0   NaN
row1  29.0     1   NaN    24    88     0   NaN
row2  52.0    77  79.0    48    32     0   NaN
row3  56.0    22  59.0     0    64     0   NaN
row4   NaN    86  10.0    93    55     0   NaN

In [10]:
df.loc[:, df.all()]

      col0  col1  col2  col4  col6
row0  69.0    88  41.0    90   NaN
row1  29.0     1   NaN    88   NaN
row2  52.0    77  79.0    32   NaN
row3  56.0    22  59.0    64   NaN
row4   NaN    86  10.0    55   NaN

In [11]:
#with atleast one non zero value
df.loc[:, df.any()]

      col0  col1  col2  col3  col4
row0  69.0    88  41.0    84    90
row1  29.0     1   NaN    24    88
row2  52.0    77  79.0    48    32
row3  56.0    22  59.0     0    64
row4   NaN    86  10.0    93    55

In [12]:
df.dropna(how='all', axis=1) # if all values in a column are NaN it wil

      col0  col1  col2  col3  col4  col5
row0  69.0    88  41.0    84    90     0
row1  29.0     1   NaN    24    88     0
row2  52.0    77  79.0    48    32     0
row3  56.0    22  59.0     0    64     0
row4   NaN    86  10.0    93    55     0

In [13]:
df.dropna(how='any', axis=1) # if any value in a row is NaN it will be dropped

      col1  col3  col4  col5
row0    88    84    90     0
row1     1    24    88     0
row2    77    48    32     0
row3    22     0    64     0
row4    86    93    55     0

In [0]:
df = df.dropna(how='any', axis=1) # new changed dataframe

In [18]:
df['new_col'] = df['col4'].apply(lambda n: n*2)#transforming frames 
df.head()

      col1  col3  col4  col5  new_col
row0    88    84    90     0      180
row1     1    24    88     0      176
row2    77    48    32     0       64
row3    22     0    64     0      128
row4    86    93    55     0      110

In [19]:
df['col7'] = df['col3'] + df['col4'] # applying arth op
df.head()

      col1  col3  col4  col5  new_col  col7
row0    88    84    90     0      180   174
row1     1    24    88     0      176   112
row2    77    48    32     0       64    80
row3    22     0    64     0      128    64
row4    86    93    55     0      110   148